### Arithmetics Operation

In [1]:
import pandas as pd

In [8]:
var = pd.DataFrame({"a":[1,2,3,4],"b":[5,6,7,8]})
print(var)

var["c"] = var["a"] + var["b"]
var

   a  b
0  1  5
1  2  6
2  3  7
3  4  8

   a  b   c
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [9]:
var["c"] = var["b"] - var["a"]
var

   a  b  c
0  1  5  4
1  2  6  4
2  3  7  4
3  4  8  4

In [10]:
var["c"] = var["a"] * var["b"]
var

   a  b   c
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [11]:
var["c"] = var["a"] / var["b"]
var

   a  b         c
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

In [12]:
var1 = pd.DataFrame({"a":[10,20,30,40],"b":[15,16,17,18]})
print(var1)

    a   b
0  10  15
1  20  16
2  30  17
3  40  18

In [13]:
var1["python"] = var1["a"] <= 20
var1

    a   b  python
0  10  15    True
1  20  16    True
2  30  17   False
3  40  18   False

In [15]:
var1["python_1"] = var1["b"] >=16
var1

    a   b  python  python_1
0  10  15    True     False
1  20  16    True      True
2  30  17   False      True
3  40  18   False      True